---
kind: type
id: T:Autodesk.Revit.UI.FaceBasedPlacementType
source: html/2211f96d-49bf-1bdd-884b-9705d4d3b70b.htm
---
# Autodesk.Revit.UI.FaceBasedPlacementType

This enumerated type specifies options available for placement of a face-based family instance.

## Syntax (C#)
```csharp
public enum FaceBasedPlacementType
```